<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

## Lab 02: Regiment Data

---

### 1. Import the necessary libraries

In [3]:
import pandas as pd

### 2. Create the DataFrame with the following values:

In [4]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### 3. Assign it to a variable called regiment.
#### Don't forget to name each column

In [13]:
regiment = pd.DataFrame(raw_data)

In [16]:
regiment.columns = (['Regiment', 'Company','Name', 'PreTestScore', 'PostTestScore'])
regiment

      Regiment Company      Name  PreTestScore  PostTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

### 4. What is the mean preTestScore from the regiment Nighthawks?

In [20]:
regiment[regiment['Regiment'] == 'Nighthawks']['PreTestScore'].mean()

15.25

In [30]:
regiment[regiment['Regiment'] == 'Nighthawks'].groupby('Regiment').mean()

            PreTestScore  PostTestScore
Regiment
Nighthawks         15.25           59.5

### 5. Present general statistics by company

In [25]:
regiment.groupby('Company').describe()

        PreTestScore                                                      \
               count       mean        std  min   25%   50%    75%   max
Company
1st              6.0   6.666667   8.524475  2.0  3.00   3.5   4.00  24.0
2nd              6.0  15.500000  14.652645  2.0  2.25  13.5  29.25  31.0

        PostTestScore
                count       mean        std   min    25%   50%   75%   max
Company
1st               6.0  57.666667  27.485754  25.0  34.25  66.0  70.0  94.0
2nd               6.0  67.000000  14.057027  57.0  58.25  62.0  68.0  94.0

### 6. What is the mean each company's preTestScore?

In [26]:
regiment.groupby('Company')['PreTestScore'].mean()

Company
1st     6.666667
2nd    15.500000
Name: PreTestScore, dtype: float64

### 7. Present the mean preTestScores grouped by regiment and company

In [28]:
regiment.groupby(['Regiment', 'Company'])['PreTestScore'].mean()

Regiment    Company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: PreTestScore, dtype: float64

### 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [34]:
regiment.groupby(['Regiment', 'Company'], as_index=False)['PreTestScore'].mean()

     Regiment Company  PreTestScore
0    Dragoons     1st           3.5
1    Dragoons     2nd          27.5
2  Nighthawks     1st          14.0
3  Nighthawks     2nd          16.5
4      Scouts     1st           2.5
5      Scouts     2nd           2.5

In [37]:
regiment.groupby(['Regiment', 'Company'])['PreTestScore'].mean().unstack(level=-2)

Regiment  Dragoons  Nighthawks  Scouts
Company
1st            3.5        14.0     2.5
2nd           27.5        16.5     2.5

### 9. Group the entire dataframe by regiment and company

In [38]:
regiment

      Regiment Company      Name  PreTestScore  PostTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [39]:
regiment.groupby(['Regiment', 'Company']).mean()

                    PreTestScore  PostTestScore
Regiment   Company
Dragoons   1st               3.5           47.5
           2nd              27.5           75.5
Nighthawks 1st              14.0           59.5
           2nd              16.5           59.5
Scouts     1st               2.5           66.0
           2nd               2.5           66.0

### 10. What is the number of observations in each regiment and company

In [40]:
regiment.groupby(['Regiment', 'Company']).size()

Regiment    Company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
dtype: int64

### 11. Iterate over a group and print the name and the whole data from the regiment

In [42]:
for name, group in regiment.groupby('Regiment'):
    print(name)
    print(group)

Dragoons
   Regiment Company    Name  PreTestScore  PostTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
Nighthawks
     Regiment Company      Name  PreTestScore  PostTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
Scouts
   Regiment Company   Name  PreTestScore  PostTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70